ПУМП/src/Catalogs/V004_D/V004_D.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>V004_D</name>
  <comment>Должности медицинских работников</comment>
  <attributes>
    <name>ID</name>
    <comment>ИД</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NAME</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SPECIALMED</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_BEG</name>
    <comment>Дата начала</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_END</name>
    <comment>Дата окончания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

ПУМП/src/Catalogs/V004/V004.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>V004</name>
  <comment>Медицинские специальности</comment>
  <attributes>
    <name>ID</name>
    <comment>ИД</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NAME</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_BEG</name>
    <comment>Дата начала</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_END</name>
    <comment>Дата окончания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

ПУМП/src/Catalogs/V004_D/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Установим условное оформление
	ОбщегоНазначенияПУМПСервер.УстановитьУсловноеФорматированиеВСпискеНСИ(Список,"DATE_END");
	//
	Если 1=2 Тогда
	Запрос=Новый Запрос;
	пТекстЗапроса=
	"ВЫБРАТЬ
	|	V004_D.Код,
	|	V004_D.ID,
	|	V004_D.NAME,
	|	V004_D.SPECIALMED,
	|	V004_D.DATE_BEG,
	|	V004_D.DATE_END,
	|	V004_D.ДатаСоздания,
	|	V004_D.ДатаИзменения,
	|	V004.NAME КАК SPEC_NAME
	|ИЗ
	|	Справочник.V004_D КАК V004_D
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.V004 КАК V004
	|		ПО V004_D.SPECIALMED = V004.ID";
	Запрос.Текст=пТекстЗапроса;
	пТЗ=Запрос.Выполнить().Выгрузить();
	ЗначениеВДанныеФормы(пТЗ,Список);
	КонецЕсли;
КонецПроцедуры
